package a_basic;

//주석 처리 된 부분
// : 코드에 대한 설명과 메모를 담당하는 기능 -> 주석 , 단축키 컨트롤 + /
// 주석은 " " 안에 있으면 안됨 -> 당연한게 " "이거 두개 사이에 있으면 문자로 나타남
/*이것은
 * 여러줄 주석
 * 입니다.
 */

//자바 프로그래밍 기본 구조
//클래스 > 매서드 > 실행문 

//클래스의 시작 
public class A_Hellojava {

	// 메서드의 시작

	public static void main(String[] args) {

//       자바 기본 문법
//		:실행문을 끝낼 떄는 항상 세미콜론(;)을 작성해야함 
//		;의 역할은 프로그램에게 종료 되었음을 알려주는 기호

//		:자바의 중괄호는 클래스, 메서드의 구조를 작성하는 기호
//		항상 열리는 중괄호와 닫히는 중괄호가 세트 

		// 컴퓨터에게 전달할 명령 (실행문)을 작성

		// - 자바의 출력
		System.out.println("Hello JAVA!!");
		// ln을 넣으면 \n

		System.out.println("Hello Coding!");

		// syso -> 컨트롤 + 스페이스바 하면 System.out.println 자동 작성

//		이클립스의 단축키
//		1. 행 이동 : 알트 + 방향키 
//		2. 단어간 커석 이동 -> 컨트롤 누르고 방향키 누르면 단어간 이동이 가능함
//		3. 자바 자동 완성은 컨트롤 + 스페이스를 통해서 가능
//		4.자동 형식 맞추기 : 컨틀로 + 쉬프트 + f 
		

	}

}
